# -*- coding: utf-8 -*-
"""
Created on Sun Mar  1 00:13:33 2026

@author: a0936
"""

print("1到10總和:",1+2+3+4+5+6+7+8+9+10)
print("計算結果:",((5+3)*(18-2)/(15-10)))
timeout=60*60+10*60
print(f"一小時又10分鐘是{timeout}秒")
print("計算結果:",(2^5*3^5*4^3)/(2^3*3^2)*(3^4*4^5))
print("園面積:",3.14*10*10)
print("球體積:",4/3*3.14*10*10*10)

import math
#amount=400*math.pow(0.5, ((500/365)/(100/365)))
amount = 400*((500/365)/(100/365))**0.5
print(f"初始400g，半衰期100天，500天后剩余{amount}克")
print("2023年的人口數是:",10/(1999-1987)*(2023-1999)+60)

